In [1]:
import pandas as pd

In [2]:
s1 = pd.read_excel('v86_fold_6_Output.xlsx')
s2 = pd.read_excel('v59_fold_3_Output.xlsx')
s3 = pd.read_excel('v86_fold_5_Output.xlsx')
s4 = pd.read_excel('v85_fold_6_Output.xlsx')
s5 = pd.read_excel('v54_fold_7_Output.xlsx')
s6 = pd.read_excel('v72_fold_6_Output.xlsx')

In [3]:
s1['Views'] = s1['Views']*.35 + s2['Views']*.05 + s3['Views']*.20 + s4['Views']*.05 + s5['Views']*.25 + s6['Views']*0.10

In [4]:
s1.head()

   Unique_ID         Views
0    1120673 -12200.377898
1    1120679   -346.395374
2    1382621   9857.906780
3    1382617 -10156.832634
4    1382622 -10156.832634

In [5]:
s1.to_excel('ensemble.xlsx', index=False)

In [6]:
s1.head()

   Unique_ID         Views
0    1120673 -12200.377898
1    1120679   -346.395374
2    1382621   9857.906780
3    1382617 -10156.832634
4    1382622 -10156.832634